Autodesk.Revit.DB.Visual.Ceramic.CommonTintColor
The property labeled "Tint Color" from the "Ceramic" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.Ceramic.CommonTintToggle
The property labeled "Tint" from the "Ceramic" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Ceramic.CeramicPatternAmount
The property labeled "Amount" from the "Ceramic" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 2".
Since:
2018.1

Autodesk.Revit.DB.Visual.Ceramic.CeramicPatternMap
The property labeled "Image" from the "Ceramic" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.Ceramic.CeramicPattern
The property labeled "Relief  Pattern" from the "Ceramic" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicPatternType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Ceramic.CeramicBumpAmount
The property labeled "Amount" from the "Ceramic" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.Ceramic.CeramicBumpMap
The property labeled "Image" from the "Ceramic" schema.
Remarks:
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
Since:
2018.1

Autodesk.Revit.DB.Visual.Ceramic.CeramicBump
The property labeled "Type" from the "Ceramic" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicBumpType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Ceramic.CeramicApplication
The property labeled "Finish" from the "Ceramic" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicApplicationType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Ceramic.CeramicColorByObject
The property labeled "Color" from the "Ceramic" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Ceramic.CeramicColor
The property labeled "Color" from the "Ceramic" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Ceramic.CeramicType
The property labeled "Type" from the "Ceramic" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Ceramic
Represents the properties of materials.
Since:
2018.1